# Introduction

pandas is one of the most powerful and widely used Python libraries for efficient data engineering. It is commonly used in combination with other analytical libraries such as scikit-lean, matplotlib, and statsmodel. This Notebook teaches the essential functionalities of pandas, including:
- Creating pandas Series and DataFrame;
- Manipulating pandas objects (e.g., reindexing, modifying, and deleting index);
- Selecting data with loc and iloc;
- Sorting and ranking data; and
- Computing descriptive statistics.

# What is pandas?

pandas is an open-source tool built on top of Python to make data cleaning and analysis fast and efficient. pandas leverages NumPy functionalities such as array-based computing, in particular array-based functions and a preference for data processing without `for` loops. The core difference between Numpy and pandas is that Numpy is developed for working with homogeneous numerical array data and pandas is best suited for working with tabular or heterogeneous data.

## Installing Pandas

The simplest way to install not only pandas, but Python and the most popular packages that make up the SciPy stack (e.g., NumPy, Matplotlib) is with [Anaconda](https://docs.continuum.io/anaconda/), a cross-platform Python distribution for data analytics and scientific computing.

To install pandas using `conda`, the package manager that the Anaconda distribution is built upon, run the following command:
`conda install pandas`

## Importing Pandas

After installation, pandas can be imported as such:
    
`import pandas as pd`

After import, whenever you see `pd.` in any of the code, it is referring to `pandas`.

# Pandas Series

pandas is made up of two core data structures: **Series** and **DataFrame**

A Series is a one-dimensional array-like object that contains a sequence of values and an associated array of labels, called _index_. You can think of a Series as a fixed-length ordered dictionary, where each index is mapped to a value.

In [62]:
import pandas as pd
import numpy as np

In [2]:
pObject = pd.Series([6,3,-2,7,-2,-2,3,0,1])
pObject

0    6
1    3
2   -2
3    7
4   -2
5   -2
6    3
7    0
8    1
dtype: int64

In the above example, `pObject` is a pandas Series. The index for this Series is displayed on the left (column 1) and the values are displayed on the right (column 2).

Since we did not specify an index for the data, a default one consisting of integers starting at 0 to N-1 is created.

To retrieve the array representation of the Series and index object, its values and index attributes can be used

In [7]:
pObject.values #get array representation of the Series

array([ 6,  3, -2,  7, -2, -2,  3,  0,  1])

In [6]:
pObject.index #get index object

RangeIndex(start=0, stop=9, step=1)

In real-world applications, it is often useful to create a Series with an index identifying each data point with a label. Here we create a Series and specify the index using the `index=` keyword.

In [9]:
pObject = pd.Series([6,3,-2,7,-2,-2,3,0,1], index=['p','i','y','a','d','u','j','q','g'])
pObject

p    6
i    3
y   -2
a    7
d   -2
u   -2
j    3
q    0
g    1
dtype: int64

Values in a Series can be selected using the labels in the index:

In [11]:
pObject['i']

3

In [12]:
pObject[['i', 'p', 'q', 'g']]

i    3
p    6
q    0
g    1
dtype: int64

In [13]:
pObject['i'] = 6
pObject['i']

6

## Filtering

It is possible to use Numpy-like operations, such as filtering with a boolean array, scalar multiplication, or applying math functions, on pandas Series. Using these operations will preserve the index-value link.

In [16]:
pObject[pObject >0] #filter the positive values

p    6
i    6
a    7
j    3
g    1
dtype: int64

In [17]:
pObject*5 #multiply all values by 5

p    30
i    30
y   -10
a    35
d   -10
u   -10
j    15
q     0
g     5
dtype: int64

In [20]:
'c' in pObject #check if 'c' is a key in pObject

False

In [22]:
'i' in pObject #check if 'i' is a key in pObject

True

## Converting Python Dictionaties to Pandas Series

If you already have data contained in a Python dictionary, it is very easy to create a Series from the dictionary. Simply pass the dictionary when creating the Series.

In [29]:
myDict = {'b': 1, 'd': 2, 'c': 3}
pObject2 = pd.Series(myDict)
pObject2

b    1
d    2
c    3
dtype: int64

When you're passing a dictionary, the index in the resulting Series will be the dict's keys. It is also possible to pass another list to be used as as the index instead.

In [31]:
myDict = {'b': 1, 'd': 2, 'c': 3}

customKeys = ['a', 'b', 'c']
pObject3 = pd.Series(myDict, index=customKeys)
pObject3

a    NaN
b    1.0
c    3.0
dtype: float64

## isnull()

In the above example, the keys `b` and `c` were found in `myDict` and placed in the appropriate locations. However, as no values were found for `a`, it appears as `NaN` (not a number) in the resulting Series.

The `isnull()` and `notnull()` functions in pandas can be used to detect missing data:

In [32]:
pd.isnull(pObject3)

a     True
b    False
c    False
dtype: bool

## notnull()

In [33]:
pd.notnull(pObject3)

a    False
b     True
c     True
dtype: bool

The above function can also be called as an instance method:

In [34]:
pObject3.notnull()

a    False
b     True
c     True
dtype: bool

## Arithmetic Operations

A useful feature of pandas Series is that it automatically aligns by index label in arithmetic operations. This is similar to the `join` operation used in databases.

In [39]:
obj1 = pd.Series([6,3,-2,7,-2,-2,3,0,1], index=['p','i','y','a','d','u','j','q','w'])
obj2 = pd.Series([-4,8,8,8,6,-3,6,8,7], index=['p','i','y','a','d','u','j','q','g'])

In [40]:
obj1 + obj2

a    15.0
d     4.0
g     NaN
i    11.0
j     9.0
p     2.0
q     8.0
u    -5.0
w     NaN
y     6.0
dtype: float64

## pandas.Series.name

In pandas, both the Series object and its index have a `name` attribute.

In [46]:
obj1.name = 'Sample Data' #assign series name
obj1.index.name = 'ind' #assign series index name

In [47]:
obj1

ind
p    6
i    3
y   -2
a    7
d   -2
u   -2
j    3
q    0
w    1
Name: Sample Data, dtype: int64

# Pandas DataFrames

The pandas DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.).

There are many ways to create a DataFrame. A common approach is from a dictionary of equal-length lists or Numpy arrays.

In [48]:
data = {"country": ["Belgium", "Norway", "Australia", "India"],
       "capital": ["Brussels","Oslo","Canberra","New Delhi"],
       "population":[1.7, 6.4, 3.9, 210]}

In [50]:
myDataFrame = pd.DataFrame(data)
myDataFrame

     country    capital  population
0    Belgium   Brussels         1.7
1     Norway       Oslo         6.4
2  Australia   Canberra         3.9
3      India  New Delhi       210.0

You can also specify the columns of DataFrame. If you pass a column that is not contained in the dictionary, it will appear with missing values in the result.

In [53]:
myDataFrame2 = pd.DataFrame(data, columns=["country","capital","population","happiness index"])
myDataFrame2

     country    capital  population happiness index
0    Belgium   Brussels         1.7             NaN
1     Norway       Oslo         6.4             NaN
2  Australia   Canberra         3.9             NaN
3      India  New Delhi       210.0             NaN

## .head()

If you have a large DataFrame, the `.head()` method can be used to select the first five rows.

In [51]:
myDataFrame.head()

     country    capital  population
0    Belgium   Brussels         1.7
1     Norway       Oslo         6.4
2  Australia   Canberra         3.9
3      India  New Delhi       210.0

## Accessing columns of a DataFrame

When you access a column/columns of a DataFrame, it is retrived as a Series. Note that the column returned from indexing a DataFrame is a _view_ on the underlying data, not a copy. Thus, any in-place modifications to the Series will be reflected in the DataFrame.

In [55]:
myDataFrame2['population'] #accessing the population column using the dictionary-like notation

0      1.7
1      6.4
2      3.9
3    210.0
Name: population, dtype: float64

In [58]:
myDataFrame2.population #accessing the population column by the attribute (i.e., attribute-like access)

0      1.7
1      6.4
2      3.9
3    210.0
Name: population, dtype: float64

## Modifying columns of a DataFrame

Columns of a DataFrame can be modified by assignment. For example, the empty happiness index could be assigned a scalar value or a list of values:

In [60]:
myDataFrame2['happiness index'] = -1
myDataFrame2

     country    capital  population  happiness index
0    Belgium   Brussels         1.7               -1
1     Norway       Oslo         6.4               -1
2  Australia   Canberra         3.9               -1
3      India  New Delhi       210.0               -1

In [72]:
#When you are assigning lists or arrays to a column, the valueâ€™s length must match the length of the DataFrame.
myDataFrame2['happiness index'] = [8.0, 7.5, 6.0, 5.5]
myDataFrame2

     country    capital  population  happiness index
0    Belgium   Brussels         1.7              8.0
1     Norway       Oslo         6.4              7.5
2  Australia   Canberra         3.9              6.0
3      India  New Delhi       210.0              5.5

## Deleting a column of a DataFrame

The `del` method can be used to remove a column.

In [74]:
# I first create a new column called megacity
myDataFrame2["megacity"] = [False, False, False, True]
myDataFrame2

     country    capital  population  happiness index  megacity
0    Belgium   Brussels         1.7              8.0     False
1     Norway       Oslo         6.4              7.5     False
2  Australia   Canberra         3.9              6.0     False
3      India  New Delhi       210.0              5.5      True

In [75]:
del myDataFrame2["megacity"]
myDataFrame2

     country    capital  population  happiness index
0    Belgium   Brussels         1.7              8.0
1     Norway       Oslo         6.4              7.5
2  Australia   Canberra         3.9              6.0
3      India  New Delhi       210.0              5.5

# Reindexing

A powerful feature of pandas is the `reindex` method. `reindex` rearranges the data according to the new index and introducing missing values if any index values were not already present.

## Reindexing a Series

In [77]:
obj = pd.Series([6,2,9,3,7], index=['a', 'b', 'c', 'd', 'e'])
obj

a    6
b    2
c    9
d    3
e    7
dtype: int64

In [78]:
obj2 = obj.reindex(['d', 'a', 'b', 'c', 'e'])
obj2

d    3
a    6
b    2
c    9
e    7
dtype: int64

## Reindexing a DataFrame

In [85]:
data = {"country": ["Belgium", "Norway", "Australia", "India"],
       "capital": ["Brussels","Oslo","Canberra","New Delhi"],
       "population":[1.7, 6.4, 3.9, 210]}

df = pd.DataFrame(data, index=['a','b','c','d'])
df

     country    capital  population
a    Belgium   Brussels         1.7
b     Norway       Oslo         6.4
c  Australia   Canberra         3.9
d      India  New Delhi       210.0

In [87]:
df2 = df.reindex(['a','b','c','d','e'])
df2

     country    capital  population
a    Belgium   Brussels         1.7
b     Norway       Oslo         6.4
c  Australia   Canberra         3.9
d      India  New Delhi       210.0
e        NaN        NaN         NaN

Columns can be reindexed with the `columns` keyword

In [90]:
columns = ['capital', 'country', 'population']
df.reindex(columns = columns)

     capital    country  population
a   Brussels    Belgium         1.7
b       Oslo     Norway         6.4
c   Canberra  Australia         3.9
d  New Delhi      India       210.0

# Dropping Entries

## Dropping entries from a Series

The `drop` method will return a **new object** with the indicated values deleted from an axis.

In [93]:
pObject = pd.Series([6,3,-2,7,-2,-2,3,0,1], index=['p','i','y','a','d','u','j','q','g'])
pObject

p    6
i    3
y   -2
a    7
d   -2
u   -2
j    3
q    0
g    1
dtype: int64

In [94]:
pObject.drop('p')

i    3
y   -2
a    7
d   -2
u   -2
j    3
q    0
g    1
dtype: int64

In [95]:
pObject.drop(['y', 'a'])

p    6
i    3
d   -2
u   -2
j    3
q    0
g    1
dtype: int64

## Dropping entries from a DataFrame

With DataFrames, index values can be deleted from either axis.

In [101]:
data = {'capital': ['Brussels','Oslo','Canberra','New Delhi'],
       'population':[1.7, 6.4, 3.9, 210]}

df = pd.DataFrame(data, index=['Belgium', 'Norway', 'Australia', 'India'])
df

             capital  population
Belgium     Brussels         1.7
Norway          Oslo         6.4
Australia   Canberra         3.9
India      New Delhi       210.0

In [103]:
#Calling `drop` with a sequence of labels will drop values from the row label (axis=0)
df.drop(['Australia', 'Norway'])

           capital  population
Belgium   Brussels         1.7
India    New Delhi       210.0

In [104]:
#Values from the columns can be dropped by passing axis=1 or axis='columns' to the drop function
df.drop('capital', axis=1)

           population
Belgium           1.7
Norway            6.4
Australia         3.9
India           210.0

It is possible to manipulate an object in-place without returning a new object using the `inplace=True` argument.

In [105]:
df.drop('capital', axis=1, inplace=True)

In [106]:
df

           population
Belgium           1.7
Norway            6.4
Australia         3.9
India           210.0

# Selection with `loc` and `iloc`

`loc` and `iloc` are special indexing operation that allow you to select a subset of rows and columns from a DataFrame using either axis labels (`loc`) or integers (`iloc`).

In [111]:
data = {'capital': ['Brussels','Oslo','Canberra','New Delhi', 'Jakarta', 'Wellington'],
       'population':[1.7, 6.4, 3.9, 210, 105, 2.1],
       'megacity': [False, False, False, True, True, False]}
df = pd.DataFrame(data, index=['Belgium', 'Norway', 'Australia', 'India', 'indonesia', 'New Zealand'])
df

                capital  population  megacity
Belgium        Brussels         1.7     False
Norway             Oslo         6.4     False
Australia      Canberra         3.9     False
India         New Delhi       210.0      True
indonesia       Jakarta       105.0      True
New Zealand  Wellington         2.1     False

## loc

In [113]:
df.loc['Australia', ['capital', 'population']] #retrive the the columns `capital` and `population` for index Australia

capital       Canberra
population         3.9
Name: Australia, dtype: object

## iloc

In [115]:
df.iloc[2, [0,1]]  #same operation as above but with `iloc`

capital       Canberra
population         3.9
Name: Australia, dtype: object

In [116]:
df.iloc[[1,2,3], [0,1]]  #same operation as above but with `iloc`

             capital  population
Norway          Oslo         6.4
Australia   Canberra         3.9
India      New Delhi       210.0

## Slicing with `loc` and `iloc`

In [120]:
df.loc[:'India', 'capital'] #get the capital of all countries up to `India`

Belgium       Brussels
Norway            Oslo
Australia     Canberra
India        New Delhi
Name: capital, dtype: object

In [123]:
df.iloc[:, :2][df.megacity == True] #get the capital and population column (:2) of all countries (:), which are classified as megacities

             capital  population
India      New Delhi       210.0
indonesia    Jakarta       105.0

# Sorting and Ranking

## Sorting

Sorting a dataset by a criterion is a common operation in real-world applications. To sort alphabetically by row or column index, use the `sort_index` method. This returns a new, sorted object.

In [126]:
#sorting a Series alphabetically
pObject = pd.Series([6,3,-2,7,-2,-2,3,0,1], index=['p','i','y','a','d','u','j','q','g'])
pObject.sort_index()

a    7
d   -2
g    1
i    3
j    3
p    6
q    0
u   -2
y   -2
dtype: int64

  
  
  
DataFrames can be sorted by index on either axis (axis 0, axis 1)

In [127]:
data = {'capital': ['Brussels','Oslo','Canberra','New Delhi', 'Jakarta', 'Wellington'],
       'population':[1.7, 6.4, 3.9, 210, 105, 2.1],
       'megacity': [False, False, False, True, True, False]}
df = pd.DataFrame(data, index=['Belgium', 'Norway', 'Australia', 'India', 'indonesia', 'New Zealand'])
df.sort_index() #sort by row index

                capital  population  megacity
Australia      Canberra         3.9     False
Belgium        Brussels         1.7     False
India         New Delhi       210.0      True
New Zealand  Wellington         2.1     False
Norway             Oslo         6.4     False
indonesia       Jakarta       105.0      True

In [130]:
df.sort_index(axis=1) #sort by column index

                capital  megacity  population
Belgium        Brussels     False         1.7
Norway             Oslo     False         6.4
Australia      Canberra     False         3.9
India         New Delhi      True       210.0
indonesia       Jakarta      True       105.0
New Zealand  Wellington     False         2.1

In [131]:
df.sort_index(axis=1, ascending=False) #sort by column index in descending order

             population  megacity     capital
Belgium             1.7     False    Brussels
Norway              6.4     False        Oslo
Australia           3.9     False    Canberra
India             210.0      True   New Delhi
indonesia         105.0      True     Jakarta
New Zealand         2.1     False  Wellington

## Ranking

Ranking is a pandas operations that assigns ranks from one through to the number of valid data points in an array. By default, equal values are assigned a rank that is the average of the ranks of those values

In [133]:
obj = pd.Series([6,3,-2,7,-2,-2,3,0,1])
obj

0    6
1    3
2   -2
3    7
4   -2
5   -2
6    3
7    0
8    1
dtype: int64

In [134]:
obj.rank()

0    8.0
1    6.5
2    2.0
3    9.0
4    2.0
5    2.0
6    6.5
7    4.0
8    5.0
dtype: float64

In [137]:
# Data can also be ranked according to the order in which they are observed.
obj.rank(method='first')

0    8.0
1    6.0
2    1.0
3    9.0
4    2.0
5    3.0
6    7.0
7    4.0
8    5.0
dtype: float64

In [138]:
# Ranks can also be assigned in descending order
obj.rank(ascending=False)

0    2.0
1    3.5
2    8.0
3    1.0
4    8.0
5    8.0
6    3.5
7    6.0
8    5.0
dtype: float64

# Computing Descriptive Statistics

pandas objects are equipped with a set of common mathematical and statistical methods. These methods have built-in handling for missing data.

In [140]:
df = pd.DataFrame([[1,2],[6,2],[-2, np.nan], [np.nan, np.nan]],
                 index=['a', 'b', 'c','d'],
                 columns=['one', 'two'])
df

   one  two
a  1.0  2.0
b  6.0  2.0
c -2.0  NaN
d  NaN  NaN

In [141]:
# the .sum() function returns the sum of the values over the requested axis.
df.sum()

one    5.0
two    4.0
dtype: float64

In [142]:
# Passing `axis=1` to the .sum() function returns the sum of the values across the columns
df.sum(axis=1)

a    3.0
b    8.0
c   -2.0
d    0.0
dtype: float64

In [143]:
# the .mean() function returns the mean of the values over the requested axis.
df.mean(axis=1)

a    1.5
b    4.0
c   -2.0
d    NaN
dtype: float64

In [144]:
# NA values are excluded unless the entire slice is NA. This can be disabled with the `skipna` option
df.mean(axis=1, skipna=False)

a    1.5
b    4.0
c    NaN
d    NaN
dtype: float64

In [145]:
# the .describe() function produces multiple summary statistics of the pandas object in one call

df.describe()

            one  two
count  3.000000  2.0
mean   1.666667  2.0
std    4.041452  0.0
min   -2.000000  2.0
25%   -0.500000  2.0
50%    1.000000  2.0
75%    3.500000  2.0
max    6.000000  2.0

# Unique Values, Value Counts, and `isin()`

In [147]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [148]:
# the .unique() function returns an array of the unique values in a Series
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [149]:
# the .value_counts() function returns a Series containing the frequency of each value
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [151]:
# the .isin() function can be used for filtering a dataset down to a subset of values in a Series or column in a DataFrame
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
mask = obj.isin(['a', 'd'])
mask

0    False
1     True
2     True
3     True
4     True
5    False
6    False
7    False
8    False
dtype: bool

In [152]:
obj[mask]

1    a
2    d
3    a
4    a
dtype: object